[
  {
    "name": "Phil Nash",
    "uri": "https:\/\/twitter.com\/philnash",
    "title": "Browsers behind your back",
    "description": "You've probably heard of the magic of a Service Worker when a user is offline, but what can we do for them when they get back online? We can take advantage of the Service Worker's life outside of the page and start to perform actions in the background.\n\nIn this talk we'll investigate the Background Sync API and the APIs that it depends upon, we'll look at what you might use it for and see it in action. Once that is behind us we can take a peek into the future and even more background tasks with a look at the Periodic Sync API."
  },
  {
    "name": "Ashley Williams",
    "uri": "https:\/\/twitter.com\/ag_dubs",
    "title": "You Don't Know npm",
    "description": "Everybody knows `npm install`. In fact, around 100,000,000 people run it everyday. But what many people don't know is that there is much more to npm than simply installing! Ashley, an ops and services engineer, will take you on a tour of npm's greatest features, old and new, and demonstrates how they can be integrated into your workflow to make you better, happier, and more productive. Along the way she'll share some of the amazing stats about npm's usage, and show off some of the lesser known registry services that npm offers to help you build your own tooling for the npm ecosystem."
  },{
    "name": "Shubheksha Jalan",
    "uri": "https:\/\/twitter.com\/ScribblingOn",
    "title": "Open Web, Open Source, Open Communities",
    "description": "The tremendous amount of activity in the JS ecosystem is a direct consequence of web being an “open” platform -- it is not owned by any particular corporation -- it’s at the disposal of the community to be advanced in the right direction. To do this and sustain its growth, we need to make sure our open source communities welcome everyone.  I want to talk about the need for safe and welcoming open source communities in the context of “a web for everyone” so that everyone can play a part in propelling it forward. This talk will be about why we should and how we can lower barriers of entry to open source."
  }
]
